#include "GameData.h"

USING_NS_CC;


/*------------------------------------------------------------------------------------
| 함 수 명  : GameData()
| 매개변수  : 
| 리 턴 값  :
| 설    명  : 생성자. 값 초기화
|------------------------------------------------------------------------------------*/
GameData::GameData()
{
	Score = 0;
	BuffItem = 0;
	DeBuffItem = 0;
	Level = 0;
}

/*------------------------------------------------------------------------------------
| 함 수 명  : initTime()
| 매개변수  : 
| 리 턴 값  :
| 설    명  : 현재 시간 초기화
|------------------------------------------------------------------------------------*/
void GameData::initTime()
{
	tm *tm;
	time_t timep = time(0);

	tm = localtime(&timep);
	Time.Year = tm->tm_year + 1900;
	Time.Month = tm->tm_mon + 1;
	Time.Day = tm->tm_mday;
	Time.Hour = tm->tm_hour;
	Time.Min = tm->tm_min;
	
}

/*------------------------------------------------------------------------------------
| 함 수 명  : getTime()
| 매개변수  : 
| 리 턴 값  : dataTime = 시간 구조체
| 설    명  : 현재 시간 리턴
|------------------------------------------------------------------------------------*/
dataTime GameData::getTime()
{
	return Time;
}

/*------------------------------------------------------------------------------------
| 함 수 명  : getScore()
| 매개변수  : 
| 리 턴 값  : int = 점수
| 설    명  : 점수 리턴
|------------------------------------------------------------------------------------*/
int GameData::getScore()
{
	return Score;
}

/*------------------------------------------------------------------------------------
| 함 수 명  : setScore(int sc)
| 매개변수  : sc = 추가 점수
| 리 턴 값  :
| 설    명  : 점수 셋팅
|------------------------------------------------------------------------------------*/
void GameData::setScore(int sc)
{
	Score += sc;

	if ( Score % 50 == 0 && Score/50 < 9 && Score != 0)
		Level += 0.1;
}

/*------------------------------------------------------------------------------------
| 함 수 명  : setBuffItem(int count)
| 매개변수  : count = 아이템 추가
| 리 턴 값  :
| 설    명  : 버프 아이템 셋팅
|------------------------------------------------------------------------------------*/
void GameData::setBuffItem(int count)
{
	BuffItem += count;
}

/*------------------------------------------------------------------------------------
| 함 수 명  : getBuffItem()
| 매개변수  : 
| 리 턴 값  : int = 버프 아이템 갯수
| 설    명  : 버프 아이템 리턴
|------------------------------------------------------------------------------------*/
int GameData::getBuffItem()
{
	return BuffItem;
}

/*------------------------------------------------------------------------------------
| 함 수 명  : getDeBuffItem()
| 매개변수  : 
| 리 턴 값  : int = 디버프 아이템 갯수
| 설    명  : 디버프 아이템 리턴
|------------------------------------------------------------------------------------*/
int GameData::getDeBuffItem()
{
	return DeBuffItem;
}

float GameData::getLevel()
{
	return Level;
}

void GameData::setLevel(float lev)
{
	Level += lev;
}